// 文章資料庫
const articles = [
  {
    id: 1,
    title: "Lāu-khok-khok kho̍k-hî kho̍k kho̍k-hî",
    source: "陳建中",
    url: "https://kiantiong.com/blog/laukhokkhokkhokhi/",
    tags: ["盤喙錦", "詩"],
    type: "mapped",
    hanji: `老硞硞鱷魚硞嘓魚
老硞硞鱷魚硞硞硞
𠕇硞硞嘓魚嘓嘓嘓
`,
    tailo: `Lāu-khok-khok kho̍k-hî kho̍k kho̍k-hî
Lāu-khok-khok kho̍k-hî kho̍k-kho̍k kho̍k
Tīng-khok-khok kho̍k-hî kho̍k kho̍k kho̍k
`,
  },
  {
    id: 2,
    title: "教典阿明的一生",
    source: "陳建中",
    url: "https://kiantiong.com/sutian/4/",
    tags: ["小說", "教典僻智識"],
    type: "single",
    content: `阿明佇一个三代同堂的家庭出世，有一个阿兄佮阿姊，自細漢𪜶阿爸就對伊真照顧，五歲猶無啥會曉講話的時陣，𪜶爸爸就誠煩惱伊的發展，厝邊閣愛共伊鼓勵講彼是「大格雞慢啼」，請伊莫緊張。
厝邊講的話誠實有影，阿明少年時代真𠢕講話，有當時仔會予人嫌講伊𠢕弄喙花，定定共人騙甲戇戇踅。
阿明體力誠好，有擋頭閣真饞食。細漢時有一改伊一直共阿兄阿姊討物件食，予阿媽共罵講伊「目睭掛斗概，看人物就愛」。
阿明就算逐頓飯都已經食四五碗矣，體格猶是真瘦，有人就按呢講伊是「瘦田𠢕欶水」。
教典嘛有記錄著伊佇學校中晝頓食傷濟食歹腹肚的故事，閣有伊佇走標比賽得著頭名的故事。
個性的部份逐家對伊的評價其實是差真濟，佮伊無捌遐深的人會講伊誠陰鴆，捎無伊咧想啥，毋過伊的好朋友攏講伊其實是一个古意的人，另外伊其實嘛真好頭喙，人緣袂䆀。
阿明嘛真好生張，教典有記錄著伊佮同學練閹雞行的故事。 阿明大漢了後就徙去臺北拚事業開店做生理，做三年外就做甲真發達，順順利利娶某、成家立業。
𪜶某嘛誠傑出，有一改阿明想欲借錢擴展事業開連鎖店的時陣，佳哉𪜶某有好好仔去評估風險共伊阻擋，抑無阿明可能彼改就會舞甲破產呢。
阿明除了做生理以外，閣有去予人牽去做師仔，嘛做甲真出眾。阿明閣誠有孝，攏有共伊骨力做穡的所趁寄轉去厝裡。
生囝了後嘛了解人所講的「手抱孩兒，才知爸母時」的意義。
阿明退休以後就無遐順利矣，伊凊彩共伊的退休金攏提去炒股票，想欲一睏仔就好額，煞共錢攏輸輸去，伊傷晏才學著「欲好額等後世，欲做官學做戲」的道理，已經袂赴矣。
伊的個性閣傷陰鴆，閣愛弄喙花，逐改攏袂堪得人講得，見若講著伊的毋著，伊就「見笑轉受氣」，實在誠害。
𪜶囝閣真不孝，所致阿明的人生尾段是真孤單，無人欲共伊照顧。`,
  },
  {
    id: 3,
    title: "芫荽皮蛋(phî-tàn)豬血粿pizza",
    source: "Liz",
    url: "https://liztaigi.blogspot.com/2021/07/phi-tanpizza.html",
    tags: ["散文", "生活"],
    type: "single", // 單一文本
    content: `我愛食芫荽、愛食皮蛋、愛食豬血粿、愛食 pizza，這幾項物件鬥做伙，對我來講是有夠 siânn--lâng，毋過想欲試 ê 人實在有限，除了本來就驚芫荽 ê 攏無好喙掠外，準是有佮意這幾項 ê 人，嘛袂當接受in做伙。
哪有啥袂當做伙 ê 啦。我認為創意口味有兩个重點，第一是這幾項食物敢會扴味(ke̍h-bī)，第二就是共個別的食材 kap 做伙 ê 「醬」，只要毋是扴味 ê 組合，加上適合 ê 醬，應該就袂䆀。
我有先去看伊 ê 官方介紹。我感覺「有一个羶」 ê 物件攏有機會鬥陣，會當互相對抗佮融合。芫荽、皮蛋(phî-tàn)、豬血、cheese 攏是有羶 ê 食材，融合 ê 媒介，第一用塗豆粉，無意外，因為夜市仔咧賣 ê 豬血粿就有糝，定著無問題；另外一項是 BBQ 醬，想想 leh 嘛有通，因為烘肉有各種肉羶，BBQ醬會當應付所有 ê 肉羶，用佇遮有合理。
同事咧招，我定著愛綴啦，今仔日中晝總算是予我食著這个傳說 ê 口味。
Hóo，有影袂䆀！伊有共 cheese  ê 比例減少，BBQ 醬有發揮作用予逐家好好仔鬥陣，皮蛋烘過以後閣有鹹卵仁 ê 芳氣。本底我煩惱豬血粿佮 pizza 餅攏是粉漿類，會傷 uì、口感有可能傷過厚重，結果 leh，伊限定使用薄餅，餅脆脆、豬血粿 khiū-khiū，有夠 tah-bā！
昨昏看報導，有人講會當淋東泉番薑仔醬，這嘛有理 neh，所以我就紮來辦公室，兩種口味攏讚喔！`,
  },
  {
    id: 4,
    title: "貓仔",
    source: "Liz",
    url: "https://liztaigi.blogspot.com/2022/04/blog-post.html",
    tags: ["散文"],
    type: "single", // 漢羅對應文本
    content: `貓仔無去了後，厝內加誠恬靜。
老歲仔貓，無像囡仔時代會佇厝內kho̍k-kho̍k-tsông，大部份ê時間其實攏咧睏，kan-na腹肚枵佮欲愛人共捋毛ê時會iaunn，照講袂差遐濟。
「閣減咱佮伊講話ê聲音啊。」牽ê按呢講。
「咱有遐捷佮伊講話喔？」凡勢有。
細漢，伊無啥會iaunn。應該是兩禮拜大ê時接過手，我大學畢業拄出社會，伊猶未斷奶，三點鐘愛飼一改，我只好共伊偷偷仔載去公司，佇超商買牛奶，伊食一湯匙、我食180CC，彼段時間我牛奶啉有夠濟。
斷奶了後，我去上班、伊就家己屈佇我稅ê房間，囡仔貓愛四界tsông，頂頂下下，飛天鑽地。房間地板是磨石仔，我共tshu鬥片仔地毯，逐工下班轉來定著隨片拆拆掀掀開。彼時伊攏無聲，袂輸啞口。第一个過年，共放佇房間兩暗無人陪，我轉去彼工伊iaunn甲偌激動。原來毋是啞口，是金喙毋願開。
一目nih，已經是20冬前ê代誌。20冬，毋管感情佮事業按怎起起落落，貓仔抱leh，就是上大ê安慰。
老貓佮老人攏仝症頭，生骨刺，龍骨骨節相黏，有時伊疼kah會哀，食保養品以後有改善，總是，行路愈來愈食力，跤腿ê筋肉開始消瘦，不時會軟跤，前跤跤骨嘛變形，後來閣放血尿，予醫生看嘛無路用。佳哉後來朋友介紹一位好醫生，共阮解說講，遮ê症頭攏是因為龍骨相黏ê疼造成ê，好袂tsiâu-tsn̂g，建議阮予伊食神經性止疼藥仔，維持伊ê生活品質就好，莫閣做啥治療。
經過伊ê開破，阮嘛開始接受，都食kah這个歲矣，逐工ê日子攏是趁著ê。
趁kah彼工，伊毋食矣。嘛毋是毋食，有想欲去食，毋知按怎煞喙去bak-bak--leh就走。伊本底就足瘦，胃口閣誠好，閣較袂堪得無食。阮看毋是勢，用注射筒灌肉湯予伊食，伊勉強吞落，嘛是閣吐吐出來，灌食ê時伊會滾躘，看著足毋甘，足毋甘。
伊是毋是想欲離開矣？勉強共留leh，敢好？
後來，連水都毋願啉，kan-na the佇膨椅喘氣，閣不時想欲換位，若像按怎都無四序。彼暗，阮共抱佇眠床邊，電火毋敢禁，睏袂落眠。伊已經無行路ê氣力，煞毋知按怎，一下仔欲去客廳，一下仔欲來房間，阮就順伊ê意，共伊抱過來、抱過去。
早起，牽ê上早班已經出門，我歇睏。一下精神隨去共看，仝款倒佇膨椅，喙已經有小可仔開開。阮有查過資料，知影伊隨時就會老去矣。
共伊mooh去曝日，伊無愛；佇膨椅tshu一塊毯仔予伊倒，伊閣一直想欲peh起來，可能傷光；共徙去內底勢倚壁ê位，伊就無閣起來矣。我坐佇伊身邊，輕輕仔共摸，心臟猶有咧跳、有喘氣，只是毋知人矣，像阿媽彼時仝款。彼工，我嘛是覆佇阿媽身軀邊，摸伊ê頭毛佮面，共伊講，阿媽，真多謝你。
心肝仔貓仔，真多謝你。你圓lin-lin ê 目睭，古錐閣巧神，恁老母喔，較妝嘛無你一半媠。心肝仔貓仔，真多謝你，有夠矣，若欲去，免掛意，嘛毋通驚惶，阿母佇遮。
賰氣絲仔，目睭金金，聽講就是會按呢。我毋甘看嘛毋甘走，伊蹄仔冷冷，攏無振動。最後，小躘一下，一口氣吐出來，無喘氣矣，心臟iáu勻勻仔跳，無偌久，佇我手底，跳上尾一下。
我提衫共崁leh，袂擋得，háu出聲。
欲暗仔載伊去火化，焚化爐hōng-hōng叫，我佮牽ê攏無講話。中途，火葬場ê工作人員共thà-thà--leh，伊佇遐，嘛無佇遐。
「好矣。」彼个人共骨頭烌pué-pué出來，捀來阮面前。我共伊ê毯仔mooh牢牢，無矣。彼个人講：「阮做這途，看誠濟矣，勸你一句，在生有共惜就好。」
好。細細罐仔ê茶米罐，貓仔造型。開門，「貓仔，咱轉到厝矣。」
無貓仔ê日子嘛是愛繼續，仝款起床，仝款上班，仝款下班煮食，只是毋免飼貓仔、免摒貓仔砂矣，嘛無貓仔通抱，袂閣佮貓仔講話矣。
阮共囥佇結婚證書頭前，約束予好，等阮攏變做罐仔，就會使囥做伙矣。`,
  },
  {
    id: 5,
    title: "Lô-má-jī jī-hîng ê kerning",
    source: "陳建中",
    url: "https://kiantiong.com/jihing/tasa_typeface_collection_intro/",
    tags: ["字型技術"],
    type: "single",
    content: `It-puann lán lóng lia̍h-tsún kóng tsò Lô-má-jī jī-hîng kah Hàn-jī pí sī tsin kán-tan, in-uī jī-sòo khah tsió. M̄-koh Lô-má-jī beh tsù-ì ê sè-tsiat kî-si̍t put-tsí-á tsē, tshiūnn kerning tō-sī tsi̍t ê tsin hó ê lē.
Kerning tsit ê su̍t-gí leh kóng jī-hîng siat-kè-su tsiam-tuì Lô-má-jī tsi-kan kū-lî ê si-á-geh. Kā jī-hû tsi-kan ê kū-lî tshiâu hōo koh-khah sù-sī tsū-jiân ê kang-hu.
Pí-lūn kóng lán nā-sī tú-tio̍h "AV" kah "Wa" nn̄g-tsióng tsoo-ha̍p, jī-hîng siat-kè-su ē kā in ê kū-lî tshiâu khah uá--leh. Ba̍k-tsiu khuànn--khí-lâi tsiah bē làng tsi̍t ê phang.
Tâi-gí Lô-má-jī ū 1 kuá Ing-gí khah bē tshut-hiān ê hû-hō tsoo-ha̍p, pí-lūn-kóng ū siann-tiāu hû-hō ê jī-bó, koh ū kah liān-jī hû-hō "-" tsi-kan ê kuan-hē ài tsiàu-kòo. Pe̍h-uē-jī ê phīnn-im hû-hō mā sī tsi̍t ê tsin ti̍k-pia̍t ê kak-sik, in-uī i siá khah kuân.
Āu-piah nā-sī tsiap piau-tiám hû-hō ia̍h-sī liân-jī hû-hō tō su-iàu tshiâu khah uá--leh, thâu-tsîng tú-tio̍h A mā ài tshiâu, tsiah bē lî siunn hn̄g ia̍h-sī làng tsi̍t ê phang.
    `,
  },
  {
    id: 6,
    title: "揤怒，是一个無禮貌的行為。",
    source:
      "複製文圖書館台文翻譯館 Ho̍k tsè bûn tôo su kuán Tâi bûn huan i̍k kuán",
    url: "https://www.facebook.com/permalink.php?story_fbid=pfbid0A8APsU4YaGBQKuKBihHU8gWBd4EDeXfTc7yysJwUUwKL9t7Vf8xSZAEUJTz11hKal&id=100077577577186",
    tags: ["複製文"],
    type: "single",
    content: `自面冊推出表情功能了，豐富著逐家的面冊生活。
最近有一个足奇怪的現象，就是鋪文內底，加減攏會有幾若个怒。
這不止仔反常，因為一篇鋪文，是用戶費盡心神，甚至是想欲佮逐家分享家己的動態所出現的。
照理來講，逐家應該以「讚」抑是「笑」、「哭」、「愛心」遮的有同理心的表情來回應鋪文者，哪會是用怒咧，非常不可取。
而且，恁敢有發現？「怒」予人囥佇咧表情的上尾一个，這可能代表講是真的不得已，真的無想欲看著別人鋪文，才會去做的最後手段。
所以，我佇遮共逐家呼籲，揤怒進前請三思，對你我攏好，攏更加友善。
上尾，揤怒真正是一个無禮貌的行為，咱做伙實踐、行動，做伙起造一个有禮貌的社交箍仔。
`,
  },
  {
    id: 7,
    title: "兄弟啊，這篇文咱共刣挕捒好無？",
    source:
      "複製文圖書館台文翻譯館 Ho̍k tsè bûn tôo su kuán Tâi bûn huan i̍k kuán",
    url: "https://www.facebook.com/permalink.php?story_fbid=pfbid027Qu7AQLvHqspBdBUEQxQPowJKqXbWbKuZCH23zFntcmLiQxFgyo5qKhGumYrTSLel&id=100077577577186",
    tags: ["複製文"],
    type: "single",
    content: `兄弟啊，這篇文咱共刣挕捒好無？你講的代誌佮阮朋友的經驗有淡薄仔sio-siāng。
我個人是無要緊啦，這嘛無牽涉著我，我是佇邊仔共看。
我完全無問題，毋過阮朋友拍算會凊心。伊會感覺無自在，想欲睏，甚至想欲哭。
毋是我啦，絕對毋是。我無啥要緊，咧共阮朋友設想爾。
伊這馬真脆弱，我毋才建議共刣挕捒。
當然，欲挃欲留，攏是你家己決定。我無要緊，是想欲照顧阮朋友爾。
伊較愛哭啦，到尾攏是我欲共安慰neh，刣掉較好啦，honnh？共刣掉。
刣挕捒就好矣。我真正無想欲看阮朋友咧艱苦。
`,
  },
];
