// 文章資料庫
const articles = [
  {
    id: 1,
    title: "Lāu-khok-khok kho̍k-hî kho̍k kho̍k-hî",
    source: "陳建中",
    url: "https://kiantiong.com/blog/laukhokkhokkhokhi/",
    tags: ["盤喙錦", "詩"],
    type: "mapped",
    hanji: `老硞硞鱷魚硞嘓魚
老硞硞鱷魚硞硞硞
𠕇硞硞嘓魚嘓嘓嘓
`,
    tailo: `Lāu-khok-khok kho̍k-hî kho̍k kho̍k-hî
Lāu-khok-khok kho̍k-hî kho̍k-kho̍k kho̍k
Tīng-khok-khok kho̍k-hî kho̍k kho̍k kho̍k
`,
  },
  {
    id: 2,
    title: "教典阿明的一生",
    source: "陳建中",
    url: "https://kiantiong.com/sutian/4/",
    tags: ["小說", "教典僻智識"],
    type: "single",
    content: `阿明佇一个三代同堂的家庭出世，有一个阿兄佮阿姊，自細漢𪜶阿爸就對伊真照顧，五歲猶無啥會曉講話的時陣，𪜶爸爸就誠煩惱伊的發展，厝邊閣愛共伊鼓勵講彼是「大格雞慢啼」，請伊莫緊張。
厝邊講的話誠實有影，阿明少年時代真𠢕講話，有當時仔會予人嫌講伊𠢕弄喙花，定定共人騙甲戇戇踅。
阿明體力誠好，有擋頭閣真饞食。細漢時有一改伊一直共阿兄阿姊討物件食，予阿媽共罵講伊「目睭掛斗概，看人物就愛」。
阿明就算逐頓飯都已經食四五碗矣，體格猶是真瘦，有人就按呢講伊是「瘦田𠢕欶水」。
教典嘛有記錄著伊佇學校中晝頓食傷濟食歹腹肚的故事，閣有伊佇走標比賽得著頭名的故事。
個性的部份逐家對伊的評價其實是差真濟，佮伊無捌遐深的人會講伊誠陰鴆，捎無伊咧想啥，毋過伊的好朋友攏講伊其實是一个古意的人，另外伊其實嘛真好頭喙，人緣袂䆀。
阿明嘛真好生張，教典有記錄著伊佮同學練閹雞行的故事。 阿明大漢了後就徙去臺北拚事業開店做生理，做三年外就做甲真發達，順順利利娶某、成家立業。
𪜶某嘛誠傑出，有一改阿明想欲借錢擴展事業開連鎖店的時陣，佳哉𪜶某有好好仔去評估風險共伊阻擋，抑無阿明可能彼改就會舞甲破產呢。
阿明除了做生理以外，閣有去予人牽去做師仔，嘛做甲真出眾。阿明閣誠有孝，攏有共伊骨力做穡的所趁寄轉去厝裡。
生囝了後嘛了解人所講的「手抱孩兒，才知爸母時」的意義。
阿明退休以後就無遐順利矣，伊凊彩共伊的退休金攏提去炒股票，想欲一睏仔就好額，煞共錢攏輸輸去，伊傷晏才學著「欲好額等後世，欲做官學做戲」的道理，已經袂赴矣。
伊的個性閣傷陰鴆，閣愛弄喙花，逐改攏袂堪得人講得，見若講著伊的毋著，伊就「見笑轉受氣」，實在誠害。
𪜶囝閣真不孝，所致阿明的人生尾段是真孤單，無人欲共伊照顧。
`,
  },
  {
    id: 3,
    title: "芫荽皮蛋(phî-tàn)豬血粿pizza",
    source: "Liz",
    url: "https://liztaigi.blogspot.com/2021/07/phi-tanpizza.html",
    tags: ["散文", "生活"],
    type: "single", // 單一文本
    content: `我愛食芫荽、愛食皮蛋、愛食豬血粿、愛食 pizza，這幾項物件鬥做伙，對我來講是有夠 siânn--lâng，毋過想欲試 ê 人實在有限，除了本來就驚芫荽 ê 攏無好喙掠外，準是有佮意這幾項 ê 人，嘛袂當接受 in 做伙。
哪有啥袂當做伙 ê 啦。我認為創意口味有兩个重點，第一是這幾項食物敢會扴味(ke̍h-bī)，第二就是共個別的食材 kap 做伙 ê 「醬」，只要毋是扴味 ê 組合，加上適合 ê 醬，應該就袂䆀。
我有先去看伊 ê 官方介紹。我感覺「有一个羶」 ê 物件攏有機會鬥陣，會當互相對抗佮融合。芫荽、皮蛋(phî-tàn)、豬血、cheese 攏是有羶 ê 食材，融合 ê 媒介，第一用塗豆粉，無意外，因為夜市仔咧賣 ê 豬血粿就有糝，定著無問題；另外一項是 BBQ 醬，想想 leh 嘛有通，因為烘肉有各種肉羶，BBQ 醬會當應付所有 ê 肉羶，用佇遮有合理。
同事咧招，我定著愛綴啦，今仔日中晝總算是予我食著這个傳說 ê 口味。
Hóo，有影袂䆀！伊有共 cheese ê 比例減少，BBQ 醬有發揮作用予逐家好好仔鬥陣，皮蛋烘過以後閣有鹹卵仁 ê 芳氣。本底我煩惱豬血粿佮 pizza 餅攏是粉漿類，會傷 uì、口感有可能傷過厚重，結果 leh，伊限定使用薄餅，餅脆脆、豬血粿 khiū-khiū，有夠 tah-bā！
昨昏看報導，有人講會當淋東泉番薑仔醬，這嘛有理 neh，所以我就紮來辦公室，兩種口味攏讚喔！
`,
  },
  {
    id: 4,
    title: "貓仔",
    source: "Liz",
    url: "https://liztaigi.blogspot.com/2022/04/blog-post.html",
    tags: ["散文"],
    type: "single", // 漢羅對應文本
    content: `貓仔無去了後，厝內加誠恬靜。
老歲仔貓，無像囡仔時代會佇厝內 kho̍k-kho̍k-tsông，大部份 ê 時間其實攏咧睏，kan-na 腹肚枵佮欲愛人共捋毛 ê 時會 iaunn，照講袂差遐濟。
「閣減咱佮伊講話 ê 聲音啊。」牽 ê 按呢講。
「咱有遐捷佮伊講話喔？」凡勢有。
細漢，伊無啥會 iaunn。應該是兩禮拜大 ê 時接過手，我大學畢業拄出社會，伊猶未斷奶，三點鐘愛飼一改，我只好共伊偷偷仔載去公司，佇超商買牛奶，伊食一湯匙、我食 180CC，彼段時間我牛奶啉有夠濟。
斷奶了後，我去上班、伊就家己屈佇我稅 ê 房間，囡仔貓愛四界 tsông，頂頂下下，飛天鑽地。房間地板是磨石仔，我共 tshu 鬥片仔地毯，逐工下班轉來定著隨片拆拆掀掀開。彼時伊攏無聲，袂輸啞口。第一个過年，共放佇房間兩暗無人陪，我轉去彼工伊 iaunn 甲偌激動。原來毋是啞口，是金喙毋願開。
一目 nih，已經是 20 冬前 ê 代誌。20 冬，毋管感情佮事業按怎起起落落，貓仔抱 leh，就是上大 ê 安慰。
老貓佮老人攏仝症頭，生骨刺，龍骨骨節相黏，有時伊疼 kah 會哀，食保養品以後有改善，總是，行路愈來愈食力，跤腿 ê 筋肉開始消瘦，不時會軟跤，前跤跤骨嘛變形，後來閣放血尿，予醫生看嘛無路用。佳哉後來朋友介紹一位好醫生，共阮解說講，遮 ê 症頭攏是因為龍骨相黏 ê 疼造成 ê，好袂 tsiâu-tsn̂g，建議阮予伊食神經性止疼藥仔，維持伊 ê 生活品質就好，莫閣做啥治療。
經過伊 ê 開破，阮嘛開始接受，都食 kah 這个歲矣，逐工 ê 日子攏是趁著 ê。
趁 kah 彼工，伊毋食矣。嘛毋是毋食，有想欲去食，毋知按怎煞喙去 bak-bak--leh 就走。伊本底就足瘦，胃口閣誠好，閣較袂堪得無食。阮看毋是勢，用注射筒灌肉湯予伊食，伊勉強吞落，嘛是閣吐吐出來，灌食 ê 時伊會滾躘，看著足毋甘，足毋甘。
伊是毋是想欲離開矣？勉強共留 leh，敢好？
後來，連水都毋願啉，kan-na the 佇膨椅喘氣，閣不時想欲換位，若像按怎都無四序。彼暗，阮共抱佇眠床邊，電火毋敢禁，睏袂落眠。伊已經無行路 ê 氣力，煞毋知按怎，一下仔欲去客廳，一下仔欲來房間，阮就順伊 ê 意，共伊抱過來、抱過去。
早起，牽 ê 上早班已經出門，我歇睏。一下精神隨去共看，仝款倒佇膨椅，喙已經有小可仔開開。阮有查過資料，知影伊隨時就會老去矣。
共伊 mooh 去曝日，伊無愛；佇膨椅 tshu 一塊毯仔予伊倒，伊閣一直想欲 peh 起來，可能傷光；共徙去內底勢倚壁 ê 位，伊就無閣起來矣。我坐佇伊身邊，輕輕仔共摸，心臟猶有咧跳、有喘氣，只是毋知人矣，像阿媽彼時仝款。彼工，我嘛是覆佇阿媽身軀邊，摸伊 ê 頭毛佮面，共伊講，阿媽，真多謝你。
心肝仔貓仔，真多謝你。你圓 lin-lin ê 目睭，古錐閣巧神，恁老母喔，較妝嘛無你一半媠。心肝仔貓仔，真多謝你，有夠矣，若欲去，免掛意，嘛毋通驚惶，阿母佇遮。
賰氣絲仔，目睭金金，聽講就是會按呢。我毋甘看嘛毋甘走，伊蹄仔冷冷，攏無振動。最後，小躘一下，一口氣吐出來，無喘氣矣，心臟 iáu 勻勻仔跳，無偌久，佇我手底，跳上尾一下。
我提衫共崁 leh，袂擋得，háu 出聲。
欲暗仔載伊去火化，焚化爐 hōng-hōng 叫，我佮牽 ê 攏無講話。中途，火葬場 ê 工作人員共 thà-thà--leh，伊佇遐，嘛無佇遐。
「好矣。」彼个人共骨頭烌 pué-pué 出來，捀來阮面前。我共伊 ê 毯仔 mooh 牢牢，無矣。彼个人講：「阮做這途，看誠濟矣，勸你一句，在生有共惜就好。」
好。細細罐仔 ê 茶米罐，貓仔造型。開門，「貓仔，咱轉到厝矣。」
無貓仔 ê 日子嘛是愛繼續，仝款起床，仝款上班，仝款下班煮食，只是毋免飼貓仔、免摒貓仔砂矣，嘛無貓仔通抱，袂閣佮貓仔講話矣。
阮共囥佇結婚證書頭前，約束予好，等阮攏變做罐仔，就會使囥做伙矣。
`,
  },
  {
    id: 5,
    title: "Lô-má-jī jī-hîng ê kerning",
    source: "陳建中",
    url: "https://kiantiong.com/jihing/tasa_typeface_collection_intro/",
    tags: ["字型技術"],
    type: "single",
    content: `It-puann lán lóng lia̍h-tsún kóng tsò Lô-má-jī jī-hîng kah Hàn-jī pí sī tsin kán-tan, in-uī jī-sòo khah tsió. M̄-koh Lô-má-jī beh tsù-ì ê sè-tsiat kî-si̍t put-tsí-á tsē, tshiūnn kerning tō-sī tsi̍t ê tsin hó ê lē.
Kerning tsit ê su̍t-gí leh kóng jī-hîng siat-kè-su tsiam-tuì Lô-má-jī tsi-kan kū-lî ê si-á-geh. Kā jī-hû tsi-kan ê kū-lî tshiâu hōo koh-khah sù-sī tsū-jiân ê kang-hu.
Pí-lūn kóng lán nā-sī tú-tio̍h "AV" kah "Wa" nn̄g-tsióng tsoo-ha̍p, jī-hîng siat-kè-su ē kā in ê kū-lî tshiâu khah uá--leh. Ba̍k-tsiu khuànn--khí-lâi tsiah bē làng tsi̍t ê phang.
Tâi-gí Lô-má-jī ū 1 kuá Ing-gí khah bē tshut-hiān ê hû-hō tsoo-ha̍p, pí-lūn-kóng ū siann-tiāu hû-hō ê jī-bó, koh ū kah liān-jī hû-hō "-" tsi-kan ê kuan-hē ài tsiàu-kòo. Pe̍h-uē-jī ê phīnn-im hû-hō mā sī tsi̍t ê tsin ti̍k-pia̍t ê kak-sik, in-uī i siá khah kuân.
Āu-piah nā-sī tsiap piau-tiám hû-hō ia̍h-sī liân-jī hû-hō tō su-iàu tshiâu khah uá--leh, thâu-tsîng tú-tio̍h A mā ài tshiâu, tsiah bē lî siunn hn̄g ia̍h-sī làng tsi̍t ê phang.
`,
  },
  {
    id: 6,
    title: "揤怒，是一个無禮貌的行為。",
    source:
      "複製文圖書館台文翻譯館 Ho̍k tsè bûn tôo su kuán Tâi bûn huan i̍k kuán",
    url: "https://www.facebook.com/permalink.php?story_fbid=pfbid0A8APsU4YaGBQKuKBihHU8gWBd4EDeXfTc7yysJwUUwKL9t7Vf8xSZAEUJTz11hKal&id=100077577577186",
    tags: ["複製文"],
    type: "single",
    content: `自面冊推出表情功能了，豐富著逐家的面冊生活。
最近有一个足奇怪的現象，就是鋪文內底，加減攏會有幾若个怒。
這不止仔反常，因為一篇鋪文，是用戶費盡心神，甚至是想欲佮逐家分享家己的動態所出現的。
照理來講，逐家應該以「讚」抑是「笑」、「哭」、「愛心」遮的有同理心的表情來回應鋪文者，哪會是用怒咧，非常不可取。
而且，恁敢有發現？「怒」予人囥佇咧表情的上尾一个，這可能代表講是真的不得已，真的無想欲看著別人鋪文，才會去做的最後手段。
所以，我佇遮共逐家呼籲，揤怒進前請三思，對你我攏好，攏更加友善。
上尾，揤怒真正是一个無禮貌的行為，咱做伙實踐、行動，做伙起造一个有禮貌的社交箍仔。
`,
  },
  {
    id: 7,
    title: "兄弟啊，這篇文咱共刣挕捒好無？",
    source:
      "複製文圖書館台文翻譯館 Ho̍k tsè bûn tôo su kuán Tâi bûn huan i̍k kuán",
    url: "https://www.facebook.com/permalink.php?story_fbid=pfbid027Qu7AQLvHqspBdBUEQxQPowJKqXbWbKuZCH23zFntcmLiQxFgyo5qKhGumYrTSLel&id=100077577577186",
    tags: ["複製文"],
    type: "single",
    content: `兄弟啊，這篇文咱共刣挕捒好無？你講的代誌佮阮朋友的經驗有淡薄仔 sio-siāng。
我個人是無要緊啦，這嘛無牽涉著我，我是佇邊仔共看。
我完全無問題，毋過阮朋友拍算會凊心。伊會感覺無自在，想欲睏，甚至想欲哭。
毋是我啦，絕對毋是。我無啥要緊，咧共阮朋友設想爾。
伊這馬真脆弱，我毋才建議共刣挕捒。
當然，欲挃欲留，攏是你家己決定。我無要緊，是想欲照顧阮朋友爾。
伊較愛哭啦，到尾攏是我欲共安慰 neh，刣掉較好啦，honnh？共刣掉。
刣挕捒就好矣。我真正無想欲看阮朋友咧艱苦。
`,
  },
  {
    id: 8,
    title: "O̍h 電腦真心適",
    source: "高嘉徽",
    url: "https://tsbp.tgb.org.tw/2015/12/blog-post_86.html",
    tags: ["科技學習"],
    type: "single",
    new: false,
    content: `阮爸母 chū 我 sè-hàn ê sî tō 真疼--我，in 送我去補習班補心算、作文、英語 kap 電腦。會 kì eh 印象上深--ê tō-sī 去電腦補習班補電腦。
Hit-sî ê 我 chiah 讀國校 5 年 niâ，而且我自 sè-hàn tō tùi 電腦真有興趣。我國校 5 年 niâ tō ē 上網頁設計課程。上課 ê 時我 chiok 專心，學著 chiok chē 電腦 ê 智識 kap 按怎設計網頁。
我做出來 ê 成品竟然 hō͘ 老師 o-ló，講我設計 liáu chiâⁿ好。會記得 hit-sî ê 我 hō͘ 老師講 chò-liáu chiok 讚，我是歡喜 ka̍h!因為 hit-sî 我 iáu-koh sè-hàn，só͘-tì 我 mā kap pa̍t ê 囡仔 kâng-khoán，chiâⁿ 愛 sńg。
利用下課時間 sńg 電腦 ê game，tng-tong 我 sńg kah chiok siak-phah ê 時，hō͘ 老師講：「Eh!上課 ah--o͘h!
mài koh sńg--ah。」Koh hō͘ 老師 liām。
M̄-koh hit-sî 我 iáu-koh 是 chi̍t-ê 囡仔 niâ，其實愛 sńg 是 chiâⁿ四常 ê 代誌。
Āu--lâi seng 6 年，我 tō 選 PPT ê 課程上，而且 hit-sî 學著 ê 物件竟然影響我 kàu 讀大學，sīm-chì 是出社會。阿爸 kap 阿母開 ê 錢 chin-chiàⁿ是無浪費。
其實國中 kàu 高中，學校 mā-sī 有電腦課，ah m̄-koh chi̍t 禮拜 chiah 1 節課，實在學無偌濟。我 tī 學校學電腦印象上深--ê，tō-sī tī 我 14 歲 ê 時，有 chi̍t 改上 PPT ê 課，老師 kiò 阮 kau PPT ê 作業，我是 hō͘ 老師 o-ló 上濟--ê。
老師 kā 我 ê 成品展 hō͘ 全班看，講我 chò-liáu 偌好 tú 偌好，老師講 ê 話對 14 歲 ê 我來講，是 chi̍t-ê 真大 ê 鼓勵，mā hō͘ 囡仔時代 ê 我 chi̍t chióng khéng-tēng。
Kóng--khì-lâi，學電腦趣味 koh 心適，sè-hàn ê 記持 chiâⁿ-chò 我心中特別 ê 回憶！
`,
  },
  {
    id: 9,
    title: "你敢知影銀票是按怎無法度影印？",
    source: "你敢知影",
    url: "https://www.youtube.com/shorts/h8U2hXucf5E",
    tags: ["僻智識"],
    type: "single",
    new: false,
    content: `你敢知影銀票是按怎無法度影印？
我話講代先，影印銀票是犯法 ê！
就算印袂出來，你有準備欲印，就有可能是犯罪矣，上無 mā ài 受調查 koh ài 上法院，所以逐家千萬毋通烏白試。
大部份 ê 影印機仔 mā 會阻止人提銀票來影印，啊機仔是按怎知影彼是銀票 leh？
原來是銀票頂面 ê 圖內底，有藏一種特別 ê 圖樣佇內底，簡單講，是圈仔排列做真特定 ê 形狀，若像星座仝款 ê 圖形，影印機仔掃著這種圖形，內底 ê 程式就會跳出來阻止人繼續印落去。
`,
  },
  {
    id: 10,
    title: "規工的！",
    source:
      "複製文圖書館台文翻譯館 Ho̍k tsè bûn tôo su kuán Tâi bûn huan i̍k kuán",
    url: "https://www.facebook.com/photo.php?fbid=212649594304191&set=pb.100077577577186.-2207520000&type=3",
    tags: ["複製文"],
    type: "mapped",
    new: false,
    hanji: `兄弟啊，咱進前應該無熟似啦。
應該是無冤無仇啦乎？
啊恁爸踏佇遮好好，
你硬欲過來共恁爸摸兩下仔
恁爸啊已經無講話矣，
你這馬規氣共恁爸的頭挽落來是按怎？
害恁爸這馬 tann 大漢爾，這馬隨欲去投胎！
規工的！
`,
    tailo: `Hiann-tī--ah, lán tsìn-tsîng ing-kai bô si̍k-sāi--lah.
Ìng-kai sī bô-uan-bô-siû--lah--honnh?
Ah lín-pē ta̍h tī tsia hó hó,
Lí ngē beh kuè--lâi kā lín-pē bong nn̄g-ē-á
lín-pē ah í-king bô kóng-uē--ah,
lí tsit-má kui-khì kā lín-pē ê thâu bán--lo̍h-lâi sī án-nuá?
Hāi lín-pē tsit-má tann tuā-hàn niā, tsit-má suî beh khì tâu-thai!
Kui-kang--ê!
`,
  },
  {
    id: 11,
    title: "NASA太空人",
    source: "高嘉徽",
    url: "",
    tags: ["自然科學"],
    type: "single",
    new: false,
    content: `我自細漢就真 kah-ì 看科學類 ê chheh， m̄-koán 是動物--ê 抑是外星球 ê chheh 我 lóng 真愛讀。
今仔日 beh 講--ê，是有關外星 ê 代誌。自我國中就讀著地球人登入月球 téng，koh 有收集月娘 ê 石頭來做實驗， 看有外星人 ê 存在無。
地球人對外星是足 hòⁿ-hiân--ê，第 1 ê 登陸月娘 ê 是美國人，tī hit-ê 年代，chit 種代誌是稀罕--ê，NASA ê 太空人替人類完成夢想。
我讀高中一年仔 ê 時，有想 beh 大漢了去美國 NASA ê 中心去看 māi。
彼時 gín-á-tioh ê 我真正是足想 beh 去 NASA--ê。
M̄-koh 這馬 ê 我看彼時 ê 我，實在有夠天真，he m̄-sī hiah-nī 簡單 ê 代誌。
Koh 有 chi̍t ê 較 hàm ê 代，就是我有 bat 想過去 NASA 做太空人 ê 想法，實在有夠好笑--ê。
Sui-bóng 大漢了無實現， m̄-koh 學會曉台文，來記錄 gín-á 時代對科學 ê 期待，嘛是 chi̍t 層真特別 ê 代誌。
向望我家己 koh 寫出無 kâng-khoán 自然主題 ê 文章--o͘h！
`,
  },
  {
    id: 12,
    title: "天 ê 面色",
    source: "張寶明 摘對《媠會穢人》台文勵志短文集",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `殕殕雺雺 ê 天，透凍冷 ê 東北季風，勼身佇厚厚的棉襀被，喙 sut-sut 叫咧喝寒。
是 30 度直降到 14 度 ê 緣故？抑是熱怫怫、純潔 ê 心，去掃著假包 ê 褒囉嗦？
貼底 ê 起毛摺規工坐袂清，用礬嘛是無效，一喙 uî-suh-kih 無顫悶著，兩喙咧？
滿滿一杯按怎？規氣提蝨篦共心肝捋捋咧，加真快活啦！
明仔載欲白雲藍天萬里 ê 青天？抑是冷冷 ê 風、毛毛 ê 雨透濫 ê 漚雨天呢？
接接袂了歹剃頭 ê 同伴，喙𪁎來裁決，接載袂牢濟濟 ê 仝溫層，扶扶挺挺來迷醉。
上驚死人--ê，親像暴衝 ê 高血壓。上樂暢--ê，親像高潮 ê 暗爽。無的確，風平浪靜、萬事太平啥代誌嘛無。
大大杯 ê 茶米茶一喙啉 lueh，滇滿這篷人 ê 喙箍，免得抐臭恬靜 ê 心海。心頭著掠予定。
向望有一斗，風雲變色凡事重來。予絞螺仔風欶走凡間的吵抐，絞淨穢涗的塗跤，
淘清齷齪的心靈，若夢醒的世界閣再來，若米篩摵出𠕇身閣白鑠鑠的食飯米。
就是愛起來窗仔前，一大喙 ku̍h-lu-ku̍h-lu 灌落咖啡，唌街路的人莫名其妙的睨，有啥物袂用得！
無，殕殕雺雺 ê 天，透凍冷 ê 風，是欲閣偌久？敢著閣看天 ê 面色？
`,
  },
  {
    id: 13,
    title: "人生日記",
    source: "張寶明 摘對《媠會穢人》台文勵志短文集",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `舊曆五月初三，禮拜，出日頭炎熱。
比武車較野 ê 越野鐵馬騎咧，kī-kuainn-kī-kuáinn 來到湖邊，跤拄仔踢直，好禮仔共拄佇路邊，行入涼亭仔歇喘。
欄閘倚咧，雙手指頭仔相閂，雙手牚上天伸予懸懸懸，大氣欶，出力吐，連幾若遍閣一遍。
無意中，目睭看對遠遠遠的水邊，連山跤 ê 所在去，景緻媠甲予我 ê 起毛摺不止仔婸，年久月深的拗鬱一斗敨放甲離離離，順紲共跤踢兩下仔，跤痠煞無去，大氣閣再喘一下。
水波炤光閃閃爍，若萬塊鏡杮仔咧補水面 ê 破空咧，共所有 ê 映影彈甲體無完膚。
水泱發(puh)袂出圓滿的圓，溢來到湖邊 sī-sā 叫。
好佳哉，水色 ê 湖水佮天 ê 笑藍䢢色𪜶猶毋知，閣咧面對面金金相，變小鬼仔面比輸贏。
予山咧笑，樹咧喝，雲咧走，船咧跳，害鳥仔看著真無奈何，趕緊走去覕，害我嘛看著真礙虐。
不如，認份，越野鐵馬騎咧，繼續 kī-kuainn-kī-kuáinn，無論會閣再拗鬱無？
跤痠無？水波會無閒袂？水泱會圓袂？猶是著走揣人生註好 ê 平靜路。
`,
  },
  {
    id: 14,
    title: "這 tsái 仔",
    source: "張寶明 摘對《媠會穢人》台文勵志短文集",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `霎雨仔 ê tsái 時仔冷冷溼溼，套頭 ê 外套穿咧，貧惰穿球鞋，赤跤就淺拖仔 lom 咧，攑七𥴊仔店 ê 俗仔雨傘，
落樓欲去食早頓，這時念頭閃出：「敢會予警察盤查(phuân-tsa)？滾耍笑！阮兜 ê 巷仔口呢！」雨傘褫開 ê 聲共念頭彈一下無去。
一時間跤底冷，姑不將共身軀勼佇這支雨傘跤，無意無意，一步一步伐，寒寒凊凊 ê 巷仔聽會著雨滴佇雨傘頂 ê 聲。
三禮拜貼貼矣，風邪 ê 病毒惡毒甲，症頭一項仔一項觸纏，身體煞有淡薄仔虛，khi-mooh-tsih 嘛沉甲貼底，佳哉，意志有穡頭做 teh 鬥支持；
佳哉，睏尾有臺語友志 teh 鬥相伨。心頭 ê 使命才做會久長。
若初春 ê 三月尾，這種冷冷仔、靜靜仔 ê 霎雨仔天，予人誠多愁善感(to-tshiû-siān-kám)！
`,
  },
  {
    id: 15,
    title: "大自然食甲飽",
    source: "張寶明 摘對 《媠會穢人》台文勵志短文集",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `歇睏日來郊外的淺山仔行踏一下，享受秋凊的涼風，走揣樹林的祕密。
爁光焱焱的日頭，頗略仔燒烙；唚微微仔吹的秋風，淡薄仔冷淡。
𧌄蜅蠐覕咧樹林偷叫幾聲，吱叫尾站的歲月；愛耍的膨鼠踮咧樹頂耍走相逐，舞弄𪜶青春的活力。
孤一種的野花霸占山崎，開滿淺粉紅仔色的花蕊，講彼是伊的花海。
行佇這條山路袂寂寞，尪仔頭的影像豐沛多變，心情透濫精彩的氣氛，四序閣輕鬆，是一逝大自然風味的旅行。
共視線站滿的草仔埔，欲坐、欲䖙、欲倒，隨在你。無體統也免歹勢，無人插你。
雙手歡迎，享受大自然的多姿多彩，欶飽清氣閣新鮮的空氣，無人會講你貪心、講你過份，遮本成就是大自然食甲飽的。
佇遮感受著的心思、搤出來的心情，貼佇面肉，無人管你咧想啥，予你的心像眾人無𫝛的表情。
就予你的心綴風去飛，敨放一切，耍予夠氣才講。
`,
  },
  {
    id: 16,
    title: "媠會穢人",
    source: "張寶明 摘對《媠會穢人》台文勵志短文集",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `頂斗佇生冷的、澹 lih-lok 的落雨天來看恁，毋知當時去矣？
Gàn-gàn 溼溼的感覺佇記持裡猶有，蓋數念！
Tsín，山櫻花規欉開甲滿滿滿，形體多姿，媠 tài 魔力，唌阮來恁的身邊品評，恁的腹腸是何等的闊！
「闊甲若像恁兜〈阿爸 ê 後花園〉。」我共詼。
「花在我開甲白白白、紅紅紅、粉紅仔粉紅。佇樹椏在我媠，湠我的魔力，共恁 tòo 甲心穎媠、喙水媠，連眠夢嘛媠甲笑 bi-bi。」恁用自信飽滇的氣口回我。
有影！媠的造形— —形、色佮材質會穢人，免 hoo-lú-bóng 催化。莫怪我櫻花痟的症頭時到就會夯起來。
狂欲共白的、粉紅仔的、大紅的的媠形揣透透，欣賞伊驚見笑的花莓，欣賞伊愛展笑容的花蕊。規蕊規蕊、規捾規捾，夠額滿足我的櫻花痟。
`,
  },
  {
    id: 17,
    title: "心窗開開",
    source: "張寶明 摘對《媠會穢人》台文勵志短文集",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `透早一下到學校教室，欲上夏日樂學第三禮拜的臺語課，隨看著佇洗手槽邊仔的水錦開甲滿滿是閣媠噹噹，
我都來兩禮拜矣，呔攏無去智覺著𪜶的存在？是我的不是。
是講，伊佇遐恬恬仔開，恬恬仔媠，袂嬈花袂奢華，本成就佮我無底代。
毋著，是我無閒𩑾𩑾，去予世事縛牢咧，煞來目眵所致。
我著共心窗開予開，無閒若無閒，頭著擔起來將身邊一切共斟酌 14 看覓，毋通共欲予你的寶貝落勾去、蹧躂去，
無，你就了去人生一改的精彩。這是因為人生欲豐沛，你著用心佇四箍圍仔的人情世事佮萬物百態。
著，我今毋通一心一意佇孤項的代誌鑽牛角，趕緊將心掠出來看一下身軀邊的世界才著。
只要心窗開開，四界攏是驚喜，攏是幸福。
「粉紅仔色的水錦，花瓣有特別影目的花紋，媠甲無地比。」
我停落來共欣賞，得著的結論精彩甲。
`,
  },
  {
    id: 18,
    title: "先知無先知記事",
    source: "李勤岸 《和室春秋》28",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `彼工乒乓拍了，行出來體育館，行落去停車場，beh 行去捷運站。
因為頂懸 ê 運動場當 teh 造作，行路 ê 人 ài 軁過地下停車場。停車場光線無蓋好，koh ài 注意車輛，我真注神行路。
雄雄腦裡浮出一个人名，真久無來去 ê 人名。聽著尻脊後有人 teh 叫我，越頭，驚一趒，彼个人名浮出來目睭前。
「你都先知 m̄！」
敢按呢？其實我真驚有這號能力！我因為按呢，刣死阮小弟。
第一 kái 發生 ê 時，我猶是幼嬰仔，阮老母 kā 我偝 leh。阮行過水圳橋，下跤是水溝仔。
水圳橋中央是水圳，雙跤 ài 開開，迒 tī 水圳頂，寬寬仔徙步，我 kā 阿母講，你 m̄-thang 摔落去 neh！
講了，阮老母就摔落去橋跤，落胎，阮小弟就按呢 hōo 我刣死。
我遐細漢，猶 hōo 偝巾包 leh，就變成一个殺人兇手。
此後，我真少講話，真閉思，無話無句，無熟似 ê lóng 掠準我啞口。
我真驚一開喙就會刣死人。
這世人經過 ê 代誌遐爾濟，有 ê 我先知，有 ê mā 無先知。
譬如彼工透早食早起 ê 時，會 hōo 阮某罵，我就先知。
阮兩个好好仔坐 leh 做伙食 pháng、啉咖啡。
阮已經真久 lóng 無風無搖，平安過日。
彼早起，我頭殼浮出會 hōo 人罵 ê 感覺。我 mā 半信半疑。
忽然間，阮某聲嗽開始變 bái，講我昨暝 tī 伊 ê 夢裡 kā 伊欺負，愈講愈受氣，我講彼是你烏白夢 ê lah！
伊講無，一定是你平時對我無好，我才會按呢夢。
有夠衰！佳哉我先知，所致無繼續冤落去。
Koh 前幾工仔暗頭仔去公園散步，掛拄買 ê 蘋果牌耳機，因為進前我 lóng 掛有耳掛 ê，
真絚單，這款蘋果牌 ê 是兩粒窒入去兩个耳空，感覺隨時會落落來。若是落落去排水空就害 ah！
隨按呢想，隨真正正耳彼粒落落來。Koh 真正落落去排水空！
我就足緊張，緊 kā 彼个排水蓋掀起來，佳哉內底焦焦，無水流。
因為暗眠摸，我揣無，我就喙唇皮咇咇掣，一直喝：「My God！今 beh 按怎？」
坐 tī 邊仔涼亭仔彼个 oo-bá-sáng 行過來，用伊 ê 手電仔炤光，
看著水溝蓋邊仔有一粒耳機，kā 我講：「無落落去 lah！啊你 ê 手機仔 mā 有手電仔 ah！」
有時，代誌發生，我甚至全然無知。
彼遍 tī 文化部開會，我發言了，坐落來，phia̋ng 一聲，我倒落去塗跤，
昏昏死死去。全部 ê 人 lóng 驚著，走過來。佳哉，一分鐘後我家己醒起來，
有人緊 kā 我窒一粒「救心」，有人緊敲 119。救護車 kā 我送去上近 ê 病院。
舞弄到半暝三更，才 hōo 我出院。隔幾工回診，做心導管手術，
發現動脈有一跡斷去，「莫怪你會昏昏去！」醫生講。
彼陣是 tī 會場，有真濟人，若是 tī 無人 ê 所在，這條命就抾 bē 著 ah！
我 tsit-má 規工 lóng 掛蘋果牌手錶仔。伊隨時會注意我 ê 心率，若是摔跋倒就會隨通知緊急連絡人，同時敲 119 叫救護車。
先知無穩當逐項代誌 lóng 先知。啥物時陣會倒落去，顛倒蘋果牌 ê 手錶仔比我較先知。
--2025.12.26 台北和室
`,
  },
  {
    id: 19,
    title: "甘甜 ê『美麗』",
    source: "陳豐惠 收錄佇《台語文學有聲叢刊》14期",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `毋知為啥物，『美麗』甘甜 ê 笑容定定佇頭殼內踅來踅去，無法度拊，嘛無法度趕……。

會記得舊年春天，若(ná)「後母面」ê 氣候予人心情浮浮，為著 1 場演唱會，
我共歌仔冊紮 leh，欲行入巷仔內 1 間美容院，準備 uān-nā hőng siat-tooh，uān-nā 暗唸歌詞。
當我滿腹心事人去，「巧麗」，『勞駕』ê 喝台聲予 1 陣坐佇壁角 leh 講細聲話 ê 查某囡仔攏攑頭向我看，
其中 1 个面肉烏金烏金、目睭大大蕊、喙齒白鑠鑠 ê，搶代先走來我頭前，
笑微微共椅仔撨好勢請我坐落，閣趕緊斟 1 杯茶米茶，提上新 ê『獨家報導』周刊予我，
伊 ê 動作扭掠，我猶袂赴反應，伊就攏攢好 ah。『您有自備洗髮精嗎？』
我搖頭，開始 leh 臆伊是佗 1 族 ê 原住民？

Bunun？Tayal？Paioan？我毋敢問。伊肥軟 ê 手佇我 ê 肩胛頭、頷頸、尻脊骿出力振動，
uān-nā 掠龍 uān-nā 輕聲細說問我：『第一次來啊？會不會太大力？』我想欲斟酌看伊 ê 五官，
趁伊越頭佮隔壁 ê『小妹』開講 ê 時，偷看鏡內 ê 伊——罕得媠甲遮齊勻 ê 查某囡仔！
皮膚烏，毋過誠幼秀，目睭大蕊閣毋是 thò-thò 彼款 ê，鼻骨直直毋過毋是像阿啄仔按呢，
喙脣閣若真清氣 ê 花蕊，有自然 ê 粉紅仔色，目眉粗毋過袂感覺野氣，2 爿喙䫌飽閣圓，喙齒是健康 ê 白，
笑 ê 時，目睭微微像星，小可有酒窟仔……。
我愣愣相鏡，耳空聽著伊用伊 ê 母語 leh 佮隔壁『小妹』講話，
毋知講啥 2 人煞 leh 笑，我趕緊向頭假影 leh 反雜誌，久久毋敢攑頭。欲沖水 ê 時，
伊問我等一下欲予幾號吹，我請伊替我選，伊喝 1 聲：『二號勞點』，閣來眞細膩替我沖頭鬃，
沖了共頭鬃捘甲袂滴水才用焦面巾包起來。
按呢伊 ê 工課就算完成 ah，2 號設計師猶未過來，伊倚來我 ê 邊仔輕輕仔共我講：『我是 15 號美麗，以後來愛找我喔！』
我一直頕頭，伊笑甲予我無想欲離開。

自彼擺以後，我攏固定佇這間『巧麗』洗頭，除了『美麗』以外，猶閣有幾仔个原住民少女，
攏是洗頭 ê，1 陣做伙定定用𪜶 ê 母語開講，
有時 uān-nā 共人客洗頭，uān-nā 綴 la-jí-ooh ê melody 哼『劉德華』、『張學友』ê 歌。
我猶是較注意『美麗』ê 形影，可能是伊滿面笑容閣愛大聲講話，其他 ê 較恬，面容較暗淡。沓沓仔，
知影這陣原住民查某囡仔攏是中壢 1 間高職 ê 學生，因為建教合作才來遮實習，洗 1 粒頭趁 30 箍，
1 學期佇學校，後 1 學期就來上班。尾仔捌聽『美麗』講起，𪜶 ê 底薪是 3 千箍，
若洗較濟粒頭，閣無予頭家娘扣錢，大約 1 個月會當領 9 千箍，
蹛是蹛宿舍，食是食便當，頭家娘有足濟規定，誠嚴——『美麗』青春未成年 ê 面頂有小可怨嘆，伊講伊逐工徛 12 點鐘真忝，
手有時洗頭洗甲破皮，店裡欠人，頭家娘毋予𪜶歇假……。

遮 ê 對花蓮、台東來西岸繁華都市拍拚 ê 原住民少女對家己 ê 未來有啥款 ê 拍算 leh？
問『美麗』，伊講，畢業轉去故郷紅葉歇幾工仔就欲閣來台北，佇故鄉，環境誠好，毋過無發展，伊無可能長期蹛遐。
問伊以後想欲創啥，伊嘛毋知，干焦講洗頭趁 ê 錢傷少，無夠用，愛換頭路。伊另外 1 个同學，嘛是「太魯閣」ê，
講想欲去應徵 24 小時 ê 超商店員，上無會當趁萬外至 2 萬。

聽 2 號設計師講，『美麗』hông 退學，無畢業，定定無睏宿舍，走去伊男朋友遐過暝，
愛耍，定欲請假……彼(he)看起來誠勥跤 ê 頭家娘閣若(ná)對『美麗』真無法 ê。
𪜶講 ê，我囥佇心肝底，有強烈 ê 罪惡感予我替𪜶煩惱，煩惱𪜶迷失佇夜都市無看見日頭 ê 角落，
煩惱𪜶茫茫渺渺 hőng 去……；「漢人」足奸巧 ê neh !

『美麗』走 ah，遐 ê 原住民少女攏離開『巧麗』ah。

『美麗』甘甜笑容定定佇頭殼內踅來踅去，嘛不時出現佇我 ê 眠夢，我毋敢看伊……。
`,
  },
  {
    id: 20,
    title: "互相做伴 ê「厝內人」",
    source: "陳豐惠",
    url: "",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `我有 2 个認養 ê「查某囝」，𪜶 1 个 12 歲，號做 Becca，1 个 10 歲，號做 Baby，2 个個性真無仝，
Becca 雖罔較濟歲，毋過真活骨，不時 leh 走跳，連鞭伸筋挽頷，連鞭傱來傱去，罕得幾時坐定定；
Baby 較少年，煞逐不時攏覆(phak)佇窗仔邊看光景，無，就是勼 leh 睏，睏甲 1 圈肚比 Becca 較大！

愛運動 ê Becca 真黏我，我若欲出門，伊就直直哀，都行出巷仔口 ah，
猶閣聽會著伊尖利 ê 吼叫；抑若入門進前，猶離幾若步 leh，伊就隨感應著，
開始司奶 歡迎我轉來厝。若佇厝內，Becca 定著來坐我邊仔，
甚至主動伸手來搭我 ê 手抑是倚佇我身軀邊，若像按呢會較有安全感。
暗時我欲睏，只要行入房間，Becca 就自動跳起來眠床頂，
若毋是佇枕頭邊，就是佇跤邊，按呢相倚傍，一直到天光。

較恬靜 ê Baby 雖罔無像 Becca 按呢黏黐黐，總是伊嘛會揣有我氣味 ê 物件做倚靠，
親像我 ê 布揹仔，抑是袂記得收入去 thàng-suh ê 衫仔褲，定定變做伊 ê 椅苴抑眠床。
較趣味 ê 是，Baby 恬罔恬，若叫伊 ê 名，伊攏會應，叫 1 聲就應 1 擺 XD！
其實𪜶2 个是司奶方式無仝爾，攏是真乖巧 ê 查某囡仔 lah。
本底𪜶2 个姊妹仔互相做伴攏真和諧，料想袂到，Baby 2 冬前身體各樣蹛院 1 個月，
出院了後，Becca 煞袂認得伊，攏毋願佮 Baby 接近 ah……。

E̋？！講到遮，你敢有感覺佗位怪怪？

我這 2 个「查某囝」，是──貓仔 lah！

Becca 其實號做「白跤」，Baby 號做「白鼻」，2 个攏是傳統台灣人較無愛飼 ê「白跤蹄」；
尤其是「白鼻」，正港 ê「烏貓白跤蹄」。當初會對動物病院共𤆬轉來飼，
就是因為病院貼認養告示 3 月日了後猶是無人欲飼，我拄好彼站想欲替白跤揣 1 个伴，
聽醫生講白鼻拄出世無偌久就 hông 放拺，予好心 ê 過路人抾著𤆬去病院，醫生本底煩惱救袂活，佳哉有愈來愈勇健起來。
看著白鼻滴滴漢仔，干焦胸前有小可成 V 字 ê 白毛（台灣烏熊！）、腹肚嘛有麻芳斜 ê 白毛，鼻仔佮喙邊有一屑仔白白，
閣有穿白襪仔，其他全烏毛，實在真古錐款，就決定收伊做查某囝。

白跤佮白鼻是佮我做伴 ê「厝內人」，我真寶惜佮𪜶ê 緣份，但是外口猶有濟濟流浪 ê 貓仔佮狗仔，看著𪜶佮看著遊民仝款會心酸。
動保團體 leh 提倡 ê TNR（抑是 CNR），我真認同；平平是地球村 ê 成員，掌握真濟資源 ê 人類應該愛替較弱勢 ê 動物設想，
若欲飼動物，盡量用「認養」代替「購買」，若決定欲飼，就毋通共放捒，因為𪜶嘛是有感情 ê，𪜶佮咱仝款，會歡喜，會悲傷。

人佮動物仝家代（Lâng kap tōng-bu̍t kâng-ke tāi），
疼惜性命合應該（thiànn-sioh sènn-miā ha̍p ing-kai），
共生共存傳大愛（kiōng-sing kiōng-tsûn thuân tuā-ài），
地球和平自然來（tē-kiû hô-pîng tsū-jiân lâi）。
`,
  },
  {
    id: 21,
    title: "死亡留予性命的話",
    source:
      "温若喬 第11屆臺中文學獎臺語詩組首獎，收錄佇聯合文學雜誌2022年11月號",
    url: "https://www.instagram.com/p/Ck547aVPgLD/",
    tags: ["詩"],
    type: "mapped",
    new: false,
    hanji: `死亡留予性命的話
死是媠的
你看日欲死進前
用血染紅藍色鬱卒的天
傷感的人同情伊的落沉
相愛的人佇伊跤尾相唚

死是媠的
你看月欲死進前
用十外工沓沓仔共家己消磨
逐暝規矩仔規矩踮雲邊缺角
才勻勻仔來發伊新生的光線

死是媠的
你看海欲死進前
彼喘氣是愈來愈溫柔
魚仔一尾一尾攏想厝
連沙埔嘛醒過來跳舞

死是媠的
若無人欲死進前
哪會所有記持攏同齊唱歌
操煩閣較大嘛細甲像風沙
愛恨情仇攏化做線香一欉
`,
    tailo: `Sí-bông lâu hōo sìnn-miā ê uē
Sí sī suí ê
lí khuànn ji̍t beh sí tsìn-tsîng
iōng hueh ní-âng nâ-sik ut-tsut ê thinn
siong-kám ê lâng tông-tsîng i ê lo̍h-tîm
siong-ài ê lâng tī i kha-bué sio-tsim

Sí sī suí ê
Lí khuànn gue̍h beh sí tsìn-tsîng
iōng tsa̍p guā kang ta̍uh-ta̍uh-á kā ka-kī siau-buâ
ta̍k mê kui-kí á kui-kí tiàm hûn-pinn khih-kak
tsiah ûn-ûn-á lâi puh i sin-senn ê kng-suànn

Sí sī suí ê
lí khuànn hái beh sí tsìn-tsîng
he tshuán-khuì sī lú lâi lú un-jiû
hî-á tsi̍t bué tsi̍t bué lóng siūnn-tshù
liân sua-poo mā tshínn--kuè-lâi thiàu-bú

Sí sī suí ê
nā-bô lâng beh sí tsìn-tsîng
ná ē sóo-ū kì-tî lóng tâng-tsê tshiùnn-kua
tshau-huân koh-khah tuā mā sè kah tshiūnn hong-sua
ài-hūn-tsîng-siû lóng huà tsuè suànn-hiunn tsi̍t tsâng
`,
  },
  {
    id: 22,
    title: "浪鳥集 001",
    source: "温若喬 摘自《浪鳥集》，九歌出版社（2023）",
    url: "https://www.books.com.tw/products/0010946717",
    tags: ["詩"],
    type: "mapped",
    new: false,
    hanji: `熱天的鳥仔流浪，來阮窗前唸歌，隨飛去他方。
秋日的葉仔徛黃，無歌通唱，一聲怨慼就飄落。
`,
    tailo: `Jua̍h-thinn ê tsiáu-á liû-lōng, lâi gún thang-tsîng liām-kua, suî pue khì thann-hong.
Tshiu-ji̍t ê hio̍h-á khiā-n̂g, bô kua thang tshiùnn, tsi̍t siann uàn-tsheh tiō phiau lo̍h.
`,
  },
  {
    id: 23,
    title: "拆箬光 Thiah-ha̍h-kng",
    source: "温若喬 摘自《日花閃爍》，時報出版（2026）",
    url: "https://www.books.com.tw/products/0011039851",
    tags: ["詩"],
    type: "mapped",
    new: false,
    hanji: `拆箬光
日頭恬恬仔盤過海天相接的水平線
用幽微的拆箬光
共烏暗送去後一个暝夜
`,
    tailo: `Thiah-ha̍h-kng
Jı̍t-thâu tiām-tiām-á puânn kuè hái thinn sio-tsiap ê tsuí-pîng-suànn
iōng iu-bî ê thiah-ha̍h-kng
kā oo-àm sàng khì āu tsı̍t ê mî-iā
`,
  },
  {
    id: 24,
    title: "阿媽的結婚相",
    source: "阿媽 ê 話",
    url: "https://www.facebook.com/share/p/171xM6eNRM/",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `阿媽做查某囡仔的時，捌佇糖廠車濾仔布，嘛捌佇暗學仔教國語（日本時代的國語），
若像咱這馬的職業婦女，佇彼的時代算真 gâu 的。毋過，若嫁人就愛佇厝裡扞家，袂當閣食頭路矣。
阿媽頂仔干焦一个大姊，下仔有兩个小弟佮一个小妹，可能是愛鬥飼家，阿媽才會拖甲二十捅歲才嫁翁，
阿媽攏講伊是「老新娘」。
細漢的時，我足愛共阿媽的相片反出來看，若看若問，阿媽就會若講故事予我聽。結婚相，我干焦僥著這張爾爾。
阿媽講：「另外一張予我拆做兩半矣。因為有一改，佮恁阿公冤家，我足受氣的，就共相片拆破，無想欲閣佮伊好矣！」
另外彼張相片，中央有一條痕。阿媽講，彼嘛是冤家受氣的時拗的。
人講「無冤無家，無成夫妻」，翁仔某鬥陣，加減嘛會吵吵鬧鬧。
我自細漢看阿公阿媽的「冤家」，毋是大細聲嚷，嘛無歹聲嗽，顛倒較成咧答喙鼓，我定定聽佮佇邊仔偷笑。
阿媽攏講阿公是「阮頭家」，若欲叫阿公，攏用「喂」，毋捌直接叫名。
阿公攏叫阿媽「月子」（ge̍h tsú），有當時仔會加「戇囡」，彼就是阿公咧罵阿媽矣！
阿公干焦會罵幾句仔，袂罵幾捾，就會去邊仔矣。
這个時陣，阿媽就會細細聲仔投予我聽，若像去予老師罵的小學生仝款。
阿公阿媽受日本教育，阿媽萬項攏聽阿公的。
阿媽攏講伊較頇顢，阿公較巧，所以足濟代誌，攏愛問過阿公，阿媽才落去做。
毋過阿公嘛毋是干焦出一支喙爾，阿公會鬥買菜，會教阿媽煮，家己嘛真 gâu 煮。
阿媽人較細粒子，行路較慢，阿公人懸閣急性，定定攏是阿公佇頭前行，阿媽佇後壁逐。
到較濟歲矣，阿媽的跤較無好，行路閣較慢，阿公顛倒佮阿媽的手牽咧，兩个人慢慢仔行。
我綴佇 in 兩人的後壁沓沓仔行，想講阮阿媽按呢是毋是算好命？
`,
  },
  {
    id: 25,
    title: "阿媽無愛拜拜",
    source: "阿媽 ê 話",
    url: "https://www.facebook.com/share/p/1DF1TCoMNG/",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `阿媽無愛拜拜
阿媽兜無祀公媽，嘛無神明桌。年仔節仔，阿媽嘛無咧行廟寺。
若經過廟寺，阿媽極加雙手合十拜一个爾爾。阿媽捌講伊無愛拜拜，因為伊有一个足迷信的老母。
阮阿媽的老母，就是阮阿祖，雖然是出世佇好額人兜，閣是大查某囝，佇彼个年代嘛是無法度讀冊受教育。
十幾歲仔就開始鬥扞家，毋管是田園厝地抑是小弟的學業，攏是伊咧處理的。
毋過，嘛毋知是啥物緣故，阮阿祖真興拜拜，拄著代誌干焦會曉去求神拜佛，已經到痴迷的地步矣。
阮阿祖生八个囡仔，阮阿媽是排第二个，頂仔有一个大姊，下仔有三个小妹佮三个小弟。
大漢小妹嫁翁有身了後，煞出意外來過身。大漢小弟佇二八事件予人掠去，下落不明，等探聽著的時陣，只賰冷冰冰的屍體。
第五小妹，嘛是嫁翁了後無偌久，就得著肺炎來過往。阮阿媽的第二小弟，讀高中蹛學寮的時陣腹肚疼，是盲腸炎，
阮阿祖無 tshuā 伊去予醫生看，顛倒去求神明，討香烌轉來予伊食，結果當然嘛袂好，一个囡仔就按呢無去矣。
所以阿媽的兄弟姊妹，干焦賰大姨婆、四姨婆佮屘舅公。我定定綴阿媽去姨婆抑是舅公 in 兜 tshit 迌，in 嘛真捷來阿媽兜耍。
可能是我細漢無注意著，我攏毋捌看 in 咧攢拜拜的物件，敢講 in 佮阮阿媽仝款，嘛無愛拜拜？
阮阿公是屘仔囝，公媽有伯公 in 咧拜，所以阿媽兜干焦有祀阿祖的相片，無燒香嘛無敬果。
雖然無遮个外在的形式，阿公阿媽 in 對眾生的慈悲，佮對天地的尊敬，並無比人較少。
這就是我對 in 的身軀頂學著的物件。
`,
  },
  {
    id: 26,
    title: "阿媽兜 - 四周圍環境的變化",
    source: "阿媽 ê 話",
    url: "https://www.facebook.com/share/p/1D5gTdP1fH/",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `阿媽兜 - 四周圍環境的變化
阿公蹛電力公司，定定愛輪調，所以雲林縣、嘉義縣踅一大輾，尾仔才調來嘉義市。1960 年代租一間日本宿舍，佇河溝邊魚市口。
我捌共魚市進出貨的趨崎當做跙流籠來耍，轉去當然予阿媽修理。我嘛捌徛佇河溝邊的橋頭，看水流看甲戇神去（曷知是咧想啥物大代誌），
感覺跤麻麻（毋知是跤麻去抑是予狗蟻咬著），才 uān-nā 跳 uān-nā 哭，轉去揣阿媽。
1970 年代，阿公買厝矣，買佇垂楊國小後壁門遐的新村。彼是四間起的兩層樓木造建築，彼陣仔干焦有幾棟爾爾，四箍輾轉攏是田。
阿媽兜的厝前有一个魚池仔，有人罟水薸佮布袋蓮去飼雞仔、鴨仔、鵝仔佮火雞。魚池仔邊有一欉螺李（南美假櫻桃），會結紅紅的、
細細粒仔的果子，甜甜仔真好食。
熱天的下晡，大人咧睏晝，囡仔攏嘛偷旋出去 tshit 迌。去 lu̍t 飽穗的粟仔轉來耍（佇遮欲共做穡人會失禮，囡仔人毋捌代誌。
是講我干焦 lu̍t 一改，lu̍t 一點點仔爾爾）、去佮厝邊的囡仔耍....耍甲天烏烏，欲落西北雨矣，才緊走轉來。
等雨落紲，就閣走出去耍矣，耍甲日頭落山，才轉來食暗頓。
暗時，有當時仔有火金蛄，有當時仔有金龜仔會飛入來，毋過細細隻的臭腥龜仔上捷飛入來嘛上濟，若踏著就足臭的。
沓沓仔，阿媽兜厝邊的田地，一塊一塊變空地，閣佮一棟一棟的木造厝起起來。
阿媽兜厝前的魚池仔嘛坉塗變做平地。
1980 年代，河溝崁起來變做垂楊路，垂楊國小的正手爿嘛開一條大路，就是新民路。
阿媽兜佮新民路，就隔彼塊魚池仔坉起來的空地仔，所以毋免征收，毋過四箍圍仔的大樓愈起愈濟，木造的厝嘛一間仔一間番做鐵筋的的樓仔厝。
彼排 50 幾年的木造厝，毋知會當閣留偌久？
`,
  },
  {
    id: 27,
    title: "阿媽兜的好食物 - 甜粿",
    source: "阿媽 ê 話",
    url: "https://www.facebook.com/share/p/1DQf4Qqk3R/",
    tags: ["散文"],
    type: "single",
    new: false,
    content: `阿媽兜的好食物 - 甜粿
差不多過年的前幾工，阿媽就會開始攢欲炊粿的物件：烘爐佮柴攢予便，尤其是柴愛攢予夠，才袂斷火；
大鼎佮籠床猶閣有竹管粿氣，攏洗予清氣，敆予焦；秫米洗好閣愛浸一暗，隔轉工才提去 hőng 挨做米漿。
過年時仔，挨米的機器真無閒，愛排隊沓沓仔來，有當時仔愛等成點鐘呢！
米漿用桶仔捾轉來了後，沓沓仔摻紅糖落去，勻勻仔抐予齊。
烘爐的火起予著，囥大鼎起去燃水。籠床內，共粿氣排予好，鋪一重粿巾，閣鋪一重秫米紙，才佮抐好的粿漿倒入去。
聽候大鼎的水滾，就佮籠床囥起去，籠床蓋崁予峇，炊的過程袂使凊彩掀。
籠床佮大鼎的縫閣用面巾楔咧，按呢燒氣較袂走去。這个時陣，大人就去無閒別項矣，吩咐阮囡仔添柴顧火，袂使傷猛嘛袂使化去；
嘛愛顧鼎裡的水，袂使予焦去，水若無夠就愛喝大人來添。
嘛毋知愛炊偌久，等到大人講會使矣，阮就去邊仔等。
阿媽共籠床蓋掀開看一下，若好矣，就共籠床提起來，用兩條椅仔跂咧，予伊通風收水。
Ta̋nn 炊好的甜粿是軟荍荍的，色水若紅糖按呢紅牙紅牙，閣有籠床佮燒柴、甜甜芳芳的氣味，予人喙瀾強欲津落來。
這个時陣猶袂使食，愛等甜粿的表面焦水，才會使對籠床提出來，佮甜粿四箍輾轉挲一重油，按呢就較袂生菇，會當囥較久。
圍爐彼工，阿媽會共甜粿切一周落來，閣切予一片一片，搵麵粉糊落去糋，糋甲外皮酥酥、內底 khiū khiū，
一捀出來，連鞭就搶甲空空。有當時仔是直接用油落去煎，煎予小可仔軟軟、皮赤赤，就會使矣。Kauh 蒜仔食，有夠讚的啦！
`,
  },
  {
    id: 28,
    title: "藤仔花",
    source: "莊雅雯 摘自 100 年《首屆臺南文學獎得獎作品集》",
    url: "https://sites.google.com/view/ngabun/%E9%A6%96%E9%A0%81",
    tags: ["詩"],
    type: "single",
    new: false,
    content: `數念
沿著牆仔聊聊仔旋
旋上懸懸的門頂佮厝尾
變做一葩一葩的千言萬語
佇風中輕輕仔搖尾
形體 親像我
滿腹想欲對你講的話
你 敢有收著我的批？
毋甘綴風吹
數念四界飛
溫柔慈愛
我 無地通走揣
驪歌耳邊過
針揻心疼纏樹椏
你 猶原無聲無說
門牆頂的藤仔花
用無暝無日的看顧
密落去我的心肝底
敢是
你 用粉粉幼幼的花蕊
欲 託我
夢中的相會？
`,
  },
];
